
const fs = require('fs');
if (fs.existsSync('config.env')) require('dotenv').config({ path: './config.env' });
function convertToBool(text, fault = 'true') { return text === fault ? true : false; } module.exports = {


//====ඔයාගෙ අලුතෙන් ගත්ත session id එක මෙතනට දාන්න 🪄====උඩු කමා දෙක ඇතුලෙ දාන්න ඕනෙ====🎉//
SESSION_ID: process.env.SESSION_ID || "KD-PANTA-00-ojEnSCCB#AqlnuZSKpgeKGsfT08aT03lf0y8kdUmyLtM878zE05c",  

//====ඔයාගෙ monhodb url එක මෙතනට දාන්න 🎇====උඩු කමා දෙක ඇතුලෙ දාන්න ඕනෙ====🔥//
MONGODB: process.env.MONGODB || "mongodb+srv://athulakumara604:qBwvqo6IM64eT1SL@cluster0.wr7rx.mongodb.net",  

//====ඔයා ඉන්න ගෲප් වල ලින්ක් ඔටෝ ඩිලිට් වෙන්න හදාගන්න...✨
//====01. ලින්ක් ඩිලිට් වෙන්න ඕනෙ නම් 'true' ✅
//====02. ලින්ක් ඩිලිට් වෙන්න එපා නම්  'false' ⛔
ANTI_LINK: process.env.ANTILINK || "true",

//====ඔයා ඉන්න ගෲප් වල නරක වචන ඔටෝ ඩිලිට් වෙන්න හදාගන්න...✨
//====01. නරක වචන ඩිලිට් වෙන්න ඕනෙ නම් 'true' ✅
//====02. නරක වචන ඩිලිට් වෙන්න එපා නම්  'false' ⛔
ANTI_BAD: process.env.ANTI_BAD || "true",

//====මේක වෙනස් කරන්න යන්න එපා 👇====//
DELETEMSGSENDTO : process.env.DELETEMSGSENDTO === undefined ? '' : process.env.DELETEMSGSENDTO            
};
